ramsrib/vapi-watcher-face/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.3.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=262144
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_LV_COLOR_16_SWAP=y

# --- I2C driver selection ---------------------------------------------------
# The SenseCAP BSP, the Himax sscma_client and the IO expander all use the
# legacy driver/i2c.h API. esp_codec_dev would otherwise pick the new
# driver/i2c_master.h on IDF >= 5.3, and IDF aborts at boot if both are live:
#   E i2c: CONFLICT! driver_ng is not allowed to be used with this old driver
# Keeping the codec on the legacy driver is what makes the two agree.
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=y

# --- SSCMA (Himax NPU) timing ------------------------------------------------
# Copied from Seeed's own examples, which work where our defaults did not.
#
# FREERTOS_HZ is the important one. IDF defaults to 100 Hz, so every tick is
# 10 ms and every delay in the SSCMA read path inflates 10x. The protocol reads
# replies in 256-byte packets, each preceded by a sync check, so the cost
# multiplies per packet — pushing replies past sscma's 2000 ms request timeout
# and producing "request not found: <cmd>" as answers arrive after the client
# has given up.
CONFIG_FREERTOS_HZ=1000

# The process task parses JSON replies; 4096 is not enough headroom for the
# larger ones, and pinning it away from the display/audio work on CPU0 keeps it
# responsive.
CONFIG_SSCMA_PROCESS_TASK_STACK_SIZE=10240
CONFIG_SSCMA_PROCESS_TASK_AFFINITY_CPU1=y

# --- TLS memory ---------------------------------------------------------------
# Internal RAM is the scarce resource on this board, and TLS is what eats it.
# Measured low-water mark of free internal heap, same firmware, same boot:
#
#   boot + one TLS session (the caption selftest)        99,406 bytes
#   boot + a call (POST /call, websocket, caption)        7,478 bytes
#
# Three concurrent sessions at ~30 KB each is most of the difference. At 7 KB
# the failures are not allocation errors in our code — they are SPI DMA
# descriptors failing to allocate elsewhere, which surfaced as 100 dropped
# Himax transactions and a glitching display every time a call started.
#
# By default mbedTLS allocates the full IN/OUT content buffers for the life of
# each session. With dynamic buffers it allocates them per record and frees them
# in between, so an idle websocket stops holding ~20 KB it is not using — which
# is exactly the 20 KB the caption request's handshake needs.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
